sco_re = {
    "Яблочко": 50,
    "Зеленое_кольцо": 25,
    "Внешнее_кольцо": {
        1: 8,
        2: 6,
        3: 42,
        14: 36,
        7: 38,
        8: 1,
        9: 41,
        10: 14,
        11: 38,
        12: 38,
        13: 3,
        15: 48,
        17: 21,
        19: 11,
        20: 50,
    },
    "Внутреннее_кольцо": {1: 2, 2: 16, 3: 56, 5: 16, 7: 38, 14: 21, 20: 39},
}


def score(zone, sector=0):
    if sector == 0:
        return sco_re[zone]
    else:
        return sco_re[zone][sector]


print(score("Яблочко"))

print(score("Внешнее_кольцо", 1))
